<?php


namespace App\Repositories;

use App\Models\MNewWord;
use App\Models\MWordGroup;
use Exception;
use GuzzleHttp\Client;
use Illuminate\Support\Facades\Log;
use stdClass;

/**
 * 词组
 * @package App\Repositories
 */
class WordGroupV2Repository extends BaseRepository
{
    private $splitServer = array('114.67.84.223', '120.26.6.172', '116.196.101.207');
    private $splitIndex = 0;


    private $content = array(
        '1,0' => '禾木,上下,入口,口中,门口,开门,儿子,日月,耳目,大米,大火,八个,天上,人文,木头,白天,山下,出入,飞鸟,马上,白云,上车,开车,公车,少见,牛羊,小羊,毛巾,尺子,小心,大风,水手,电力,水田,广大,上升,手足,大方,半月,本子,书本,自己,东西,回车,回来,平日,开业,皮毛,生长,果皮,不用,小鱼,今天,正中,瓜果,走来,两年,左右,无风',
        '1,1' => '千万,丁冬,冬天,百万,百花齐放,说话,笑话,朋友,友人,好友,春雨,春天,春节,春风,升高,高手,长高,好友,春回大地,你们,红花,红红火火,红花绿叶,花花绿绿,爷爷,节目,节日,节气,年岁,岁月,亲人,亲手,母亲,父亲,行走,行动,自行车,万里无云,古人,古书,古老,笑声,回声,大声,多少,忙人,几个,高处,知了,不知,知足,帮忙,洗衣,洗手,认真,父母,母女,父子,父亲,父亲母亲,母亲,爸爸,完全,全家,关门,关心,写完,书写,回家,大家,家长,看书,看见,看家,看着,着火,画画,笑着,笑话,开会,高兴,书画,妈妈,奶奶,中午,上午,下午,开合,放下,放心,本子,收看,收下,收入,女儿,女子,生气,出气,火气,天气,早上,来去,回去,天亮,女孩,太多,出去,明亮,和气,和平,语文,李子秀,香水,香气,千千万万,千军万马,成千上万,千里马,鸟语花香,花香,千山,听见,听话,连长,连忙,远方,远远,远处,高远,一定,方向,向上,向往,唱片,合唱,以后,以上,以下,后来,主意,主要,总有,总和,总会,更好,更多,先后,先生,干净,赶早,赶走,赶快,起来,明天,净化,清净,一起,同年,同学,工人,专业,专心,专家,人才,天才,上级,下级,年级,连队,少先队,蚂蚁,白蚁,前后,前方,空气,真空,房子,上网,古诗,诗人,林子童,童年,儿童,童话,黄色,黄花,黄牛,关闭,花朵,美女,美好,我们,机长,是不是,不是,可是,他们,她们,送水,送气,送人,过去,过时,过年,小时,时间,让开,干吗,网吧,网虫,往日,过往,得到,很好,来来往往,往往,黄河,江河,姐弟,借口,借用,哪里,哪儿,谁的,很怕,可怕,跟着,跟前,力量,着凉,凉风,最早,最好,果园,公园,因为,光明,洗脸,笑脸,脸上,阳光,太阳,为什么,什么,许多,石头,可以,可口,可怕,办法,方法,找水,办公,石子石,石头,许多,别人,别的,别处,到处,那里,都是,吓人,叫声,叫门,再见,大象,好像,点心,点头,照片,做人,照亮,作业,做工,沙土,沙子,海军,海鸟,石桥,天桥,木桥,军队,禾苗,井水,井口,家乡,同乡,全面,面子,海面,忘本,忘记,想念,念书,想家,空想,王子,左边右边,边上,这边,进入,进去,过道,让道,知道,宝贝,原先,男女,男生,男人,爱河,起跑,飞跑,吓跑,吹气,吹牛,吹风,快车,乐队,老师,老爷,师长,师生,老朋友,朋友,长短,面对,冷淡,淡化,冷水,热水,热情,热心,热爱,对不对,拉开,拉下,把手,扫把,扫地,送给,给你,活动,生活,干活,活力,种子,种花,吃东西,东西,练习,见习,学习,苦干,苦头,学车,学生,学问,非常,非常,常常,房间,房子,中间,伙伴,共同,公共,公平,汽油,问一问,问问,公共,公共汽车,汽车,分开,十分,分手,要是,要求,没有,座位,位子,让座,孩子,女孩,男孩,选手,人选,北京,北风,南北,南京,江南,太湖,湖边,湖水,湖面,秋天,秋雨,秋季,春秋,湖光山色,只要,只是,只有,星星,明星,雪花,下雪,帮忙,请客,请问,地球,星球,足球,球员,好玩,跳远,跳高,桃花,桃树,刚才,树林,兰花,各个,各自,坐下,让座,座位,星座,皮带,带鱼,急忙,心急,名字,名气,名人,出发,发明,收成,成为,成人,晚上,早晚,动画,动用,行动,动人,新书,新衣,没有,没有什么,什么,那么,变化,变动,改变,一条,在家',
        '2,0' => '识字,宜人,果实,绿色,彩色,中华,华丽,尽心,尽情,壮丽,壮大,壮士,实心球,春华秋实,华秋实,金光,金秋时节,时节,五光十色,秋天,图画,水波,梅波,风波,海浪,灯光,灯火,工作,作业,作文,生字,写字,文字,苹果,美丽,秀丽,壮丽,劳动,黄山,尤其,其实,其他,小区,区分,巨大,巨人,它们,你们,我们,平安,安全,石块,冰块,车站,站立,天安门,一块儿,植物,妈妈,办法,已经,甲虫,豆子,绿豆,黄豆,知识,认识,纷纷,经过,如果,比如,好人,好心,好事,洼地,布娃娃,古诗,于是,首长,首先,树枝,枫叶,记住,日记,刘海,识字,胡子,看戏,京戏,棋子,下棋,钢刀,观看,弹力,弹弓,口琴,钢琴,养花,养鸟,养鸡,手风琴,五子棋,坐井观天,紫丁香,午休,伸手,甜美,唱歌,唱歌歌,歌手,山歌,院长,学院,医院,除法,除去,休息,作息,您好,牵手,困难,大扫除,牵牛花,会员,员工,青色,安宁,样子,同样,花样,学校,校园,校长,亲切,一切,教室,教养,教师,响亮,音响,上班,班会,图书,图书室,休息,休息室,办公,办公室,少先队员,青山绿水,一分钟,分钟,哈欠,元旦,元月,状元,面包,打包,钟表,钟点,叹气,叹息,迟到,迟早,闹钟,热闹,笑哈哈,哈哈哈哈,哈哈大笑,大笑,难忘,难忘的一天,一天,及时,及早,全身,车身,仔细,细小,细雨,次品,几次,外公,外面,外国,计时,礼节,加法,加班,识字,夕阳,除夕,山川,冰川,州长,台风,台灯,讲台,争气,争光,争先,人民,人民民,民歌,民族,家族,与众不同,不同,川流不息,欢庆,亿万,欢乐,祖国,红旗,军旗,旗帜,欢庆,国庆节,歌曲,戏曲,北京,中央,交往,市民,市区,市长,身旁,旁边,优秀,优点,优美,阴天,花坛,长城,城市,城门,国家,中国,外国,地图,图片,立交桥,绿树成阴,我们,成功,申办,申请,马匹,布匹,北京,京城,泪水,眼泪,海洋,拥有,拥抱,互相,相信,表扬,飞扬,喜洋洋,太平洋,娃娃,一匹马,纷纷,纷纷扬扬,看雪,讲话,讲台,打字,手指,指路,指甲,接听,接送,吃惊,故乡,时候,气候,候鸟,识字,尺寸,落叶,落地,补丁,补习,补课,拔河,拔牙,功课,功劳,功夫,帮助,助手,互助,争取,取得,所以,所有,落落大方,坐井观天,信息,信心,抬头,国际,交际,青蛙,牛娃,做错,回答,问答,还有,井底之蛙,无边无际,我要,的是,葫芦,发言,每天,每年,每次,治安,挂念,挂图,挂机,哇哇,大叫,古怪,慢慢,自言自语,千言万语,柳树,怎么,怎样,思念,思想,意思,弯月,弯曲,弯道,比分,比方,衣服,服用,口服,啦啦队,穿山甲,穿衣,衣服,比目鱼,娃娃夫人,功夫,手表,表扬,表示,告示,吹号,句号,挂号,出汗,汗水,伤心,伤口,伤员,吸气,吸收,北极,南极,酸的,甜的,串门,兔子,广告,告别,告示,告诉,诉说,狐狸,猴子,颗粒,串串,猴年马月,狐朋狗友,识字,公斤,折纸,打折,曲折,挑选,树根,根本,独自,独立,满意,容易,笑容,面容,满园春色,春色,百里挑一,独一无二,满头大汗,大汗,称赞,背后,后背,课文,木板,钢板,地板,椅子,但是,傍晚,清早,清明节,清秀,消息,消除,依山傍水,蓝色,树叶,美术,手术,吐气,注意,课文,讲课,课间,铅球,铅笔,笔记,桌子,桌椅,风景,景色,拿手,自由,自由自在,景色宜人,纸船,和风,风筝,坏人,坏话,松果,包扎,抓住,抓紧,庆祝,福气,句子,句号,幸福,幸运,幸好,头发,现在,现在开始,开始,总之,口令,发令,布匹,布告,公布,笔直,直接,正直,当时,当家,当心,第一,现在,实现,发现,日期,过期,轮椅,车轮,公路,路灯,来之不易,识字,美丑,小丑,出丑,永远,永别,饥饿,饱满,气温,温和,温暖,暖气,贫苦,丰富,富有,暖洋洋,窗前,气球,家家户户,户户,千家万户,户口,亚军,牛角,四周,病床,木床,被子,生病,看病,治病,开始,开张,假如,寻找,良好,优良,食用,食指,双手,双眼,双亲,身体,体操,操场,会场,广场,哭笑不得,哇哇,大哭,丰衣足食,日记,两则,身份,粉笔,晴天,姑妈,姑娘,大娘,表妹,姐妹,读书,洗衣粉,雨过天晴,晴空万里,古诗,龙舟,乘车,乘坐,乘法,声音,音响,请客,客气,客车,如何,为何,收音机,水汪汪,泪汪汪,汪洋大海,识字,丛林,牢记,拍手,球拍,拍打,护士,爱护,保护,保安,保温,食物,物体,公鸡,花猫,养猫,动物,动物园,红领巾,真好,羽毛,带领,领带,捉住,捉虫,理发,道理,理由,跳跃,飞跃,灵活,灵气,早晨,清晨,红领巾,蹦蹦跳跳,清澈,湖水,失去,消失,自觉,听觉,发觉,扔掉,掉队,眼角,眼泪,眼睛,火眼金睛,白纸,纸张,船长,轮船,果皮,浅水,小鱼,长久,几乎,至今,至少,死去,腰带,腰包,颗粒,米粒,谷粒,被子,起来,热乎,天长地久,父亲,亲和,合并,夜晚,夜夜,夜景,喜欢,体重,重点,加重,味道,气味,香味,轻松,轻重,立刻,刻苦,羊群,人群,喜洋洋,时时刻刻,欢天喜地,成群结队,识字,卫生,卫星,运动,幸运,宇宙,宇宙宇宙,宇宙飞船,航行,海军,军舰,我是什么,什么,冲浪,冲水,晒干,晒太阳,太阳,晒被子,水池,电池,水灾,火灾,灾民,灾害,害怕,害虫,黑色,黑夜,机器,电器,回声,上岸,花纹,指纹,洞口,影子,电影,影星,倒水,倒车,倒立,游戏,秋游,圆桌,周围,周围围,围巾,包围,太空,生活,生活趣事,水杯,杯子,纸杯,事件,信件,条件,住所,住房,胡须,能手,能力,飘动,飘扬,必须,事情,好事,事故,故事,历史,灭火,消灭,巧克力,千克,克服,变化,文化,古代,后代,孙子,外孙,种植,植树,植物园,公孙树,一代代,农业,变化,工厂厂长,办厂,生产,介意,农民,农夫,科学,眼科,科技,技术,纺织,织布,织补',
        '2,1' => '解冻,小溪,野菜,摇晃,躲闪,追寻,商店,荣幸,世界,轰鸣,呼唤,呼喊,沉睡,柳枝,终于,微笑,谢谢,浇花,拐弯,渐渐,棉花,浓密,仍然,温暖,干枯,住宿,未必,抽烟,安静,弟弟,节省,季节,花骨朵,清泉,清脆,杜鹃,宝塔,团结,需要,年迈,锋利,泥泞,洒脱,叔叔,扑打,脆弱,芬芳,应该,周末,夏天宝,宝岛,托盘,捉摸,铃声,年度,山沟,单独,故宫,打扮,特别,特别名胜,名胜古迹,雷声大作,黑白相间,展现,建造,轻纱,停留,茂密,甜蜜,爬坡,搭桥,足够,龙船,恩情,祝寿,脚步,鲜艳,凤凰,王府,雄伟,英雄,一年一度,一度,群山,环绕,风光,树木,茂盛,湖水,碧绿,隐隐约约,点点,灯光,蒙蒙,细雨,华灯,高照金,金碧辉煌,辉煌,灯光,闪烁,焕然一新,绚丽多彩,银光,五光十色,从天而降,热情,热情好客,笑容,笑容满面,另外,志向,提问,漫画,哄骗,喝水,朗读,而且,正式,整齐,邮票,使用,便条,要求,求助,丹青,乌黑,艺术,明显,忽然,旗杆,波涛,陈列,斜坡,显示,漂泊,喝彩,眼睛,目不转睛,越来越,包含,窗户,河流,停泊,绝对,低垂,逃跑,针对,蜘蛛,鸣蝉,打压,注册,,岩石,忠实,向导,碰杯,慌乱,铁路,海底,厚重,地质,埋没,彩虹,积极,稀少,稠密,害怕,事情,讨厌,鸡鸭,天鹅,沉沉,千方百计,百计,刨根问底,飞流直下,可视电话,电话,科研人员,人员,发呆,商量,拥挤,拱桥,决定,价钱,批评,购物,报纸,玻璃,收拾,破碎,光滑,继续,骄傲,信封,轻松,胳膊,聪明,停止,晃荡,肥胖,丢失,蜜蜂,列车,沉甸甸,浓墨,涂抹,轻笔,细描,目不转睛,爱国,明礼诚信,日新月异,月异,举世无双,遵纪守法,自我,自我欣赏,无能为力,言行不一,风和日丽,一声不响,楼梯,组合,脑筋,惊讶,交谈,指派,引导,敲门,附近,费用,巴望,算术,树桩,蛋壳,翅膀,欺负,筋疲力尽,守株待兔,同心协力,协力,众志成城,万众一心,战无不胜,多多益善,益善,贪小失大,舍本逐末,轻重倒置,勤学好问,天外有天,读书,其义,好学不倦,乱七八糟,勾画,勺子,珍珠,钻研,距离,数数,睡觉,宝玉,油灯,检查,斥责,夸奖,谜团,炎热,死亡,食肉,传染,严寒,人类,人类历史,历史,道理,灭绝,寒冷,地球,气温,保暖,冬眠,焦急,守护,睡眠,肯定,来不及,团团转,北斗,北斗七星,拔苗助长,数不胜数,不胜,沉思,片刻',
        '3,0' => '坪坝,穿戴,打扮,欢唱,招呼,敬礼,蝴蝶,游戏,招引,热闹,古老,铜钟,粗壮,凤尾竹,洁白,摇晃,盛开,玩耍,一本正经,正经,使劲,假装,这些,引人注目,钓鱼,观察,花瓣,合拢,手掌,有趣,峰顶,似乎,忽然,白发苍苍,咱们,奋力,终于,辫子,勇气,决心,居然,力量,郊外,散步,胸脯,欢快,面包,或者,严寒,自言自语,可惜,肯定,果然,乱跳,诚实,突然,立刻,人行道,相机,打量,摆弄,准备,胶卷,秘书,杂志,杂志社,记者,转告,著名,地质学家,捉迷藏,悄悄,躲闪,转来,兴趣,历史,平整,推动,旅行,专门,考察,秦岭,遗迹,研究,成果,震惊,精心,希望,依然,飞舞,拼命奔跑,奔跑,拉动,大惊失色,千呼万唤,寻找,垂头丧气,磨坊,继续,清凉,留意,扇子,炎热,邮票,凉爽,柿子,仙子,菠萝,气味,香甜,粮食,加紧,杨树丰,丰收,斗艳,芬芳,迷人,留心,艳丽,温度,密切,关系,娇嫩,适宜,适应,展示,需要,昆虫,传播,植物学家,修建,陆续,大致,无论,试验,试验纸,证实,飞散,几乎,大概,减少,阻力,遥远,包括,检查,迷失,准确,无误,沿途,确实,实实,记忆力,本能,名堂,浪费,镜片,清闲,放大镜,细微,阅读,随意,调节,简单,显微镜,微生物,生物,拜访,玩具,远近闻名,相距,学问,风尘仆仆,纳闷,迎候,等候,止境,长进,请教,保留,传授,敬重,品行,宇宙,黑暗,上升,下降,气息,四肢,肌肤,辽阔,血液,奔流,不息,茂盛,滋润,创造,设计,参加,全部,横跨,创举,减轻,冲击,冲击力,重量,节省,坚固,美观,石栏,样板,精美,图案,回首,遥望,双龙戏珠,才干,宝贵,遗产,风景,优美,丰富,五光十色,深蓝,高低,各种,各种各样,懒洋洋,披甲,成群结队,飘飘,摇摇,颜色,形状,百怪,渔业,工人,四脚朝天,茂密,肥料,祖祖辈辈,抽出,嫩绿,欣赏,密密层层,挡住,视线,献出,可口,鲜嫩,名贵,药材,又松,舌头,收藏,集合,招架,紧张,乌龟,自卫,进攻,炮口,坦克,合二为一,一战,战场,大显神威,首次,乱成一团,成一,长处,胜利,胜利者,冰鞋,斧头,手锯,玩意,免得,抢走,难过,算术,当初,随便,仍然,敌人,台阶,所以,懂得,骄傲,傲慢,谦虚,恼怒,相提并论,理会,荒凉,惊讶,光洁,朴素,价值,兴奋,掌声,文静,愿意,姿势,轮流,慢吞吞,注视,热烈,持久,平息,情绪,讲述,通话,动听,鼓励,成功,实验,瓶子,绳子,代表,茶杯,危险,顺利,如实,不假思索,激动,获得,给予,试探,心意,祝福,甜蜜,担心,前夕,兴高,暗示,立即,卡片,盼望,显然,拥抱,仁爱,同情,体贴',
        '3,1' => '燕子,乌黑,轻快,翅膀,剪刀,尾巴,机灵,微风,光彩夺目,增添,生机,掠过,稻田,偶尔,音符,赞歌,万紫千红,荷花,清香,挨挤,碧绿,莲蓬,破裂,仿佛,衣裳,翩翩起舞,舞蹈,蜻蜓,翠鸟,衬衫,透亮,清脆,泡泡,逃脱,打消,念头,专列,欧洲,瑞士,舒适,空调,列车,站台,特殊,长途,成千,成千上万,麻烦,气温,骤降,风雪,疲劳,饥寒交迫,温暖,政府,纷纷,救护,开动,友情,致谢,山谷,郁郁葱葱,郁葱葱,湛蓝,甜润,锋利,盖房,裸露,扩大,各式各样,工具,应有尽有,家具,喘气,黎明,洪水,寓言,亡羊补牢,羊圈,窟窿,街坊,劝告,把式,盘缠,硬要,惊弓之鸟,魏国,射箭,打猎,大雁,大吃一惊,本事,愈合,孤单,裂开,叮嘱,前排,靠边,准确,审视,讲台,神情,严肃,半晌,轮流,和颜悦色,熟悉,角度,相似,教诲,赛跑,疼爱,排除,持续,安慰,欺骗,实话,度过,日月如梭,虽然,路线,狂奔,暑假,形容,受益,无穷,用途,将来,假如,检阅,俱乐部,商定,鸦雀无声,截肢,队伍,沉默,局面,方便,情不自禁,盛大,隆重,街道,人山人海,人海,主席,主席台,观众,纠正,议论,石匠,抄写,墨水,故意,报复,缩回,诚心诚意,诚意,承认,独自,戒尺,不料,既然,祝贺,神气十足,左顾右盼,重复,安静,沉静,恰恰,缓和,外婆,建议,惊喜,表达,烦恼,享受,医院,医生,护士,消息,确认,血型,是否,酒精,掩盖,拳头,制止,轻柔,周围,钻石,焦渴,水罐,喜出望外,匆匆,匆匆忙忙,反正,递给,忍不住,新鲜,传说,差不多,温度,摄氏,钢铁,庄稼,生存,繁殖,蔬菜,热量,比较,杀菌,预防,世界,夜幕降临,夜空,悬挂,奥秘,努力,登上,任何,一旦,曾经,估计,年龄,神秘,探索,信息,信息网络,网络,遍布,信箱,五湖四海,四海,迫不及待,不及,目不转睛,米老鼠,赞叹,敞开,恋恋不舍,功能,红彤彤,浪花,睡觉,睡梦,假日,背包,防止,脖子,漆黑,壮胆,无影无踪,荒无人烟,小镇,处境,交易,鼻子,犹豫,反应,竖起,费用,用心爱,游览,工艺品,名不虚传,游人,游人如织,壮观,出售,摊点,陈列,构思,五官,五官端正,观赏,掏钱,即将,晚饭,清晰,可辨,一模一样,一样,付钱,标准,牙齿,管理,田地,人烟稀少,老百姓,旱灾,迎接,徒弟,扑腾,提心吊胆,渠道,灌溉,收成,露出,燃烧,熊熊大,大火,围困,挣扎,熄灭,喷火,缺少,冶炼,液体,金光,四射,云霓',
        '4,0' => '宽阔,笼罩,沸腾,奔腾,依旧,恢复,灿烂,竹竿,规律,缝隙,照耀,树梢,静寂,茫茫,若隐若现,昂首,风平浪静,水天相接,相接,横贯,江面,齐头并进,漫天,颤动,反差,花卉,涨潮,榕树,镇静,紫檀,百合,葡萄,茄子,紫金,盈盈,人声鼎沸,山崩地裂,不容置疑,神秘,神来之笔,之笔,千姿百态,人迹罕至,应接不暇,涓涓细流,飞瀑,滔滔,江水,苍苍,恍恍惚惚,均匀,重叠,空隙,叶柄,痕迹,逐渐,休想,住宅,隐蔽,隐藏,选择,住址,洞穴,柔弱,搜索,倾斜,平坦,宽敞,引人,注意,毫不,可惜,随遇而安,蛟龙,慎重,静谧,豪放,无聊,偶然,崭新,漂移,轻易,资料,证据,鼓舞,考证,起源,召开,假说,震动,坐卧不宁,消磨时光,不可思议,精神,大振,枉费心机,心机,浩如烟海,洋溢,允许,围墙,隆冬,孤独,训斥,覆盖,凝视,冷酷,愉快,拆除,剩下,伐木,告示牌,火辣,煤油灯,鲜花,鲜花盛开,鲜果,飘香,狂风大作,大作,雪花飞舞,飞舞,脸颊,彼此,铁锹,树杈,诧异,麦子,义务,木匠,木偶,表情,愣住,拽住,温柔,撒谎,魔杖,笑嘻嘻,兴冲冲,毛茸茸,枯枝败叶,叶勤勤,勤勤恳恳,蹦蹦跳跳,跳跳,可伶,巴巴,高傲,郑重,京剧,滋味,倘若,侍候,脾气,责备,邻近,性格,任凭,贪玩,尽职,稿纸,梅花,跌倒,开辟,局促不安,毫不,相让,一日三餐,从容不迫,扬长而去,空空如也,供养,不胜其烦,架子,十足,屏息,凝视,变化,变化多端,花落,狂吠,攀谈,泥泞,腔调,掂量,涟漪,属于,主宰,反抗,欺侮,成绩,辛苦,大叫,慢条斯理,自由,自由自在,生气勃勃,如怨如诉,盘旋,城砖,城墙,屯兵,堡垒,打仗,呼应,肩膀,智慧,凝结,长廊,建筑,宫殿,葱郁,掩映,朱红,堤岸,雕刻,狮子,佛香阁,气魄雄伟,金碧辉煌,辉煌,神清气爽,气爽,隐隐约约,姿态,不一,陡峭,耸立,画舫,远眺,鸟瞰,统率,端详,匀称,配合,雕塑,气概,嘉峪关,颐和园,崇山,举世无双,享誉世界,世界,身材,魁梧,神态自若,久经沙场,南征北战,所向披靡,跃跃欲试,若有所思,殊死,拼搏,间隔,懒惰,俗语,平衡,联结,跨越海峡,海峡,桂树,移植,幸运,台湾,袭击,期待,空旷,暂停,山洪暴发,清波,漾漾,理所当然,当然,谈何容易,平安无事,突如其来,骨肉,同胞,血脉,亲情,谴责,凋零,厉害,叮咛,嘱咐,怀抱,悲哀,湿润,喜悦,协调,有序,人影,绰号,恍然,伯父,模范,巡警,吵嚷,惩处,抱负,胸怀,喝彩,推荐,眼帘,删掉,规范,燥热,融洽,黄昏,客厅,帝国主义,主义,灯红酒绿,红酒,热闹,非凡,风和日丽,耀武扬威,得意扬扬,振兴中华,中华,驱使,崛起,余晖,蕴含,洗漱,惬意,反驳,逻辑,疏远,分析,有力,筋疲力尽,电话,电话号码,号码,形单影只,和睦相处,患难与共,受益,受益匪浅,年少气盛,年逾古稀,改观,程度,依赖,寄托,幻想,洞察,联系,恐龙,凶猛,鸽子,描绘,轻盈敏捷,因特网,原子核,呼风唤雨,出乎意料,农耕社会,社会,腾云驾雾,程控电话,电话,欣喜若狂,形态各异,数据,轻松,悦耳,仓库,储存,示范,烹调,烹炒,预约,综合,判断,提供,迟钝,例如,筛选,辐射,盐碱,远洋船舶,用武之地,之地,美味佳肴',
        '4,1' => '洞庭,江南,玩赏,无瑕,扩散,攀登,泰山,骆驼,屏障,浙江,拥挤,孔隙,仰卧,臀部,稍微,额角,蜿蜒,依据,敬亭山,波澜壮阔,水平,峰峦,雄伟,红叶,似火,拔地而起,罗列,形态,万千,色彩,危峰兀立,连绵,连绵不断,不断,突兀,凉爽,高耸,山涧,透射,寂静,增添,细碎,马蹄,柔嫩,锦缎,绵延,绚烂,重叠,斑斑点点,点点,维持,财富,精湛,器重,属于,百货,情形,道德,号码,橡皮,尊严,逃难,善良,朴实,款待,例外,喉结,赞赏,僵硬,捶背,许配,拨电话,电话,缓缓,驶过,闷闷不乐,迷惑,面呈,菜色,疲惫不堪,狼吞虎咽,骨瘦如柴,拮据,奔驰,馈赠,天律,损伤,晾晒,竹签,火候,耽误,赚钱,熟练,教导,讲究,受益,沉重,眼神,抱怨,鼓励,宽容,梦寐以求,走街串巷,将心比心,旅游,沙滩,侦察,企图,情愿,蠢事,返回,海鸥,补救,蝙蝠,清朗,捕捉,飞蛾,蚊子,避开,敏锐,铃铛,苍蝇,揭开,推进,障碍物,荧光屏,争先恐后,若无其事,见死不救,鱼贯而出,愚不可及,气喘吁吁,响彻云霄,横七竖八,筑巢,摇篮,乃至,肥沃,折腾,堤坝,侵蚀,崩塌,植被,经营,扫帚,腐烂,土壤,栖息,捕食,繁殖,制服,机翼,关键,多灾多难,随心所欲,不折不扣,枯枝,异想天开,开机,人亡,轻而易举,沉寂,盘问,口哨,埋伏,凝神,维护,壮烈,牺牲,谢意,沉浸,深情,凯旋,征衣,凝固,阿姨,精通,经济,贡献,圣坛,罪恶,呼吁,健康,不慌不忙,丛生,聚精会神,模模糊糊,糊糊,以防万一,断断续续,呻吟,宛转,芦苇,打扮,脊背,枕头,防备,卓越,蓝盔,弥漫,威胁,蔚蓝,梦幻,阻挡,睁眼,手榴弹,茵茵,飘飘,悠悠,歪斜,不速之客,浓郁,流连,流畅,引导,悄然,灵性,经历,瞬间,扑闪,概念,弧线,飞翔,权利,缤纷,鼓动,跃动,欲望,冲破,坚硬,不屈,茁壮,沉稳,震撼,糟蹋,短暂,有限,珍惜,叶茂,多姿多彩,笼罩,呵护,捐赠,器官,角膜,酷爱,遵从,失明,乏味,泛滥,辽阔,清晰,孤零零,齐刷刷,清香,袅袅,不假思索,热泪盈眶,与世长辞,重见天日,天日,傲然挺立,神气十足,一震,棚架,风趣,装饰,顺序,照例,瞧见,率领,觅食,捣衣,和谐,辛苦,白鹭,鸡冠花,大丽,房前屋后,高地,人静,牧场,专注,端庄,丝绒,镶嵌,骏马,遮掩,飞驰,沉默,闪烁,微弱,掠过,湖畔,衬衫,晶莹,音符,招呼,清凉,肺腑,麦浪,红扑扑,极目远眺,膘肥体壮,辽阔无垠,悠然自得,成群结队,默默无言,初放,此起彼落,辩论,寻常,解答,信奉,容许,违背,曾经,拖住,解释,教授,宣布,固执,栏杆,罢了,境界,绣花,厂徽,胆大妄为,见底,赏心悦目,一丝不苟,融为一体,邀请,挚友,塑像,祝贺,诞生,打扰,异样,激烈,交谈,径自,猛然,抱歉,见怪,舒畅,疑惑,坚毅,平缓,红肿,榨干,荒凉,诱人,雕塑,雕塑家,香喷喷,全神贯注,仪态,端庄,其妙,信心,信心十足,疑惑,疑惑不解,妻子,拜见,理睬,肠胃,汤药,医治,喷射,火焰,驱赶,领袖,惩罚,敬佩,火种,造福,违抗,狠心,啄食,百发百中,扁鹊,治病,无能为力,驱寒,取暖,气急败坏,唐朝,西藏,大臣,求婚,断定,豌豆,耕种,沼泽,技艺,吩咐,饶恕,规矩,胆瓶,堡垒,违背,解救,起誓,简短,口吻,吉祥如意,如意,笑逐颜开,披头散发,无恶不作,荣华富贵,富贵,恩将仇报,下流,无耻',
        '5,0' => '招牌,急切,惧怕,知趣,光顾,恐怕,充足,理由,屋檐,其实,支撑,鼓励,环绕,娱乐,感叹,周游,片段,忽略,意义,方式,倾盆大雨,毫不犹豫,贪婪,通顺,可靠,培养,起码,比喻,呐喊,饱览,报偿,驳杂,馈赠,磁石,锻炼,借鉴,饥肠辘辘,滚瓜烂熟,流光溢彩,有味,天长日久,如醉如痴,囫囵吞枣,不求甚解,悲欢离合,牵肠挂肚,如饥似渴,不言而喻,千篇一律,别出心裁,与众不同,大显身手,心安理得,念念不忘,呕心,心血,幽芳,飘泊,唯独,顿时,慈祥,稀罕,离别,大抵,精神,灵魂,民族,民族气节,磨难,欺凌,境遇,毕竟,所谓,梳理,衰老,珍藏,华侨,画风,顶天立地,地头,折节,玷污,秉性,眷恋,姿态,迷人,至少,邻居,成熟,完整,尤其,提前,潺潺,婀娜,舞姿,粼粼,波纹,干涸,点缀,螃蟹,浮现,潮湿,流通,舒服,印象,凉飕飕,盛名,香飘十里,守望相助,目前,上腭,哺乳,退化,垂直,经验,判断,胎生,特征,寿命,珍贵,急促,报警,犯罪,嫌疑,金属,银行,图纸,即使,规定,窗帘,保持,噪音,废水,集中,处理,对付,研制,博物馆,安然无恙,藕断丝连,乖巧,驯良,清秀,矫健,机警,躲藏,追逐,强烈,溪流,警觉,锐利,错杂,苔藓,勉强,遮蔽,然而,面临,颗粒,来源,分裂,飘浮,削弱,柔和,性能,依附,稳定,朝晖,单调,古今,往来,庞然大物,气象,气象万千,附近,鱼饵,辉映,剧烈,上钩,操纵,摆脱,鱼鳃,争辩,皎洁,乞求,嘴唇,沮丧,旅途,诱惑,告诫,实践,严格,永久,启示,收获,吩咐,榨油,便宜,可贵,石榴,爱慕,分辨,体面,银光,小心翼翼,翼翼,不容,争辩,依依不舍,抉择,环抱,和蔼,梦想,素净,巧妙,闪现,订购,约定,告辞,挑拨,如期,开幕,激发,简易,异常,葱茏,隐约,繁茂,蓬松,伤害,索性,细腻,陪伴,眼睑,咂嘴,流泻,信赖,星罗棋布,大喜过望,心灵,心灵手巧,源源不断,不断,不绝,受用,轻松,轻松自在,不动声色,地震,混乱,安顿,昔日,废墟,坚定,挖掘,绝望,爆炸,叹息,悲痛,颤抖,拥抱,糟糕,确实,自豪,誊写,敬仰,出版,戏剧,严厉,灵感创作,创作,源泉,警告,歧途,谨慎,把握,极端,断言,欢声笑语,破烂不堪,满怀,信心,一如既往,疲惫,忙碌,腼腆,残忍,虚弱,指教,艰涩,拖沓,磨练,埋怨,冷漠,失魂,震耳,大吃一惊,喋喋不休,雪上加霜,来日方长,忐忑不安,聊胜于无,估量,殿堂,宏伟,侵入,瑰宝,灰烬,进犯,转移,掩护,任务,崎岖,尸体,坠落,雹子,仇恨,眺望,豪迈,举世,闻明,众星拱月,玲珑剔透,亭台楼阁,情话,天南海北,海北,异宝,满腔怒火,斩钉截铁,停泊,港口,崇高,统治,浓厚,叩问,旗帜,旗杆,脊梁,刹那,硝烟,伤痕,痛苦,礼炮,扎根,悬崖绝壁,远征,典礼,委员,协商,外宾,汇集,按照,预定,排列,波浪,爆发,诞生,奋斗,庄严,宣告,欢呼,电钮,肃立,瞻仰,肃静,飘拂,选举,骑兵,高潮,次序,光明,共产党,万水千山,四面八方,排山倒海,拟定,地域,殉职,奔赴,尊重,踌躇,黯然,操劳,严肃,干扰,诚恳,簸箕,为难,胜利,保证,特殊',
        '5,1' => '高歌,柔美,渲染,勾勒,低吟,回味,洒脱,迂回,疾驰,马蹄,礼貌,拘束,羞涩,天涯,清晰,插嘴,分辩,抚摸,介绍,新疆,热乎,一碧千里,翠色欲流,飘带,一体,古朴,典雅,矗立,戎装,守候,鸵鸟,匕首,商贸,芝麻,妖娆,机械,开凿,巍峨,媒体,逞凶,撕扯,效率,贯通,下马威,精神,精神饱满,美轮美奂,严阵以待,不及,杯水车薪,车薪,废寝忘食,牧童,蓑衣,鸡笼,莲蓬,毡帽,交错,幼稚,沙漠,棉袄,驼绒,袍子,傻事,胚胎,祸患,滑翔,双臂,天赋,妨碍,岂止,痴迷,厘米,幸亏,驱逐,迫害,随心所欲,运转,运转自如,绞尽脑汁,蚂蚱,樱桃,蚌壳,瞎闹,倭瓜,水瓢,澄澈,花苞,柔软,柳絮,喧闹,梳妆,圆滚滚,水墨画,一动不动,侮辱,威风,矮小,冷笑,为难,规矩,招待,囚犯,出息,大臣,柑橘,笑嘻嘻,不是,实话实说,面不改色,安居乐业,乐业,解释,负责,完好,无损,代价,了如指掌,战役,封锁,暂时,硝烟,情谊,噩耗,强大,大嫂,篮子,咆哮,狂奔,狞笑,拥戴,清瘦,沙哑,放肆,豹子,呻吟,月堂,祭奠,乱哄哄,雪中送炭,同归于尽,深情厚谊,势不可挡,跌跌撞撞,颧骨,斑白,搪瓷,严厉,收敛,疙瘩,粗糙,抽噎,红锈,下旬,募捐,水泵,放弃,颠簸,节奏,簇拥,营地,青稞面,喜出望外,热气腾腾,无边无涯,昏迷,奄奄一息,迫不及待,辛辛苦苦,苦苦,一声,召集,商议,允诺,隆重,约定,胆怯,推辞,拒绝,能耐,诸位,推却,都督,迟延,探听,私自,自调度,水寨,擂鼓,呐喊,支援,和氏壁,军令状,无价之宝,理直气壮,气壮,完璧归赵,攻无不克,战无不胜,负荆请罪,同心协力,协力,自有,妙用,神机妙算,读读,记记,限期,吓唬,诡计,霹雳,酥软,灵通,迸裂,避暑,楷书,造化,家当,顽劣,踉踉跄跄,明明,明明朗朗,喜不自胜,天造地设,缩颈,抓耳挠腮,破绽,咕咚,侄子,穿梭,郎中,媳妇,辉煌,苗条,风骚,打量,标致,气派,手疾眼快,精神,精神抖擞,敛声屏气,屏气,放诞,无礼,转悲为喜,屁股,师傅,包袱,透亮,清爽,衔接,搜索,发怔,发傻,魔力,通融,刻薄,钞票,武断,熔岩,阔佬,雅致,考究,半信半疑,兴致勃勃,妙不可言,十全十美,天性,宇宙,真切,脊梁,船舱,保姆,祷告,停泊,威尼斯,家家户户,户户,莞尔一笑,花团锦簇,姹紫嫣红,嫣红,应接不暇,耐人寻味,纵横,纵横交叉,操纵,自如,手忙脚乱,悠闲,松弛,按摩,尴尬,绅士,气氛,感染,笨重,陶醉,斑斓,炽热,充沛,火炬,巨蟒,聆听,木薯,强悍,粗犷,篝火,熟视无睹,冲锋陷阵,彬彬有礼,翩翩起舞,摇头晃脑,繁花似锦,含情脉脉,大饱眼福,目不暇接',
        '6,0' => '清爽,吟诵,唱和,瀑布,陡峭,挺拔,身躯,精致,蕴含,奥秘,侠客,追随,小巷,俏丽,烘烤,音韵,勤勉,漫游,亲吻,德高望重,高望重,别有深意,左冲右撞,意味,意味深长,庞然大物,行色匆匆,优雅,清脆,凝聚,恶作剧,不拘一格,年过花甲,杰出,修筑,设计,设计施工,施工,阻挠,控制,轰动,艰巨,毅然,勉励,恶劣,泥浆,真挚,避免,朦胧,凄凉,引用,强烈,居庸关,悬崖,狂风,怒号,惹人,寝不安席,思潮起伏,可见一斑,一斑,调节,沉闷,分享,抚养,春节,热烈,刚劲,领略,复苏,先驱,迷恋,装点,惊叹,碧空,波涛起伏,水落石出,牙牙学语,舒适,搁板,勉强,抱怨,倾听,掀起,魁梧,撕破,严肃,神圣,悠悠,庄重,仪式,抱歉,溜走,介意,追问,荒唐,声望,割舍,淋淋,心惊肉跳,自言自语,自作自受,缝缝补补,补补,大吃一惊,残疾,瘦削,宽厚,张皇,竭力,泰然,强制,茫然,劝阻,焦黄,着迷,耐心,修理,如愿,流连忘返,身无分文,溜之大吉,十指连心,怒目,圆睁,兴高,遥望,晶莹,资源,矿物,恩赐,节制,枯竭,滥用,威胁,指望,设想,破碎,目睹,圣洁,骏马,雄鹰,潺潺,滋润,善待,松脂,宝贵,滋养,婴儿,眷恋,和蔼可亲,闪闪发光,葬礼,主持,语调,悲剧,治理,归宿,荡漾,滔滔不绝,一泻千里,纷至沓来,世外桃源,从天而降,生命垂危,垂危,风雨同舟,厨房,刺猬,畜生,遗体,挽联,致敬,爱抚,团聚,情节,记性,保存,阴暗,寒意,深奥,详细,枯瘦,逝世,文章,咳嗽,晃晃,失声,痛哭,囫囵吞枣,张冠李戴,马马虎虎,恍然,北风,匆匆,匆匆忙忙,饱经风霜,殷勤,失业,厚实,苗头,面孔,轻视,陡然,艰苦,软绵绵,牛毛细雨,细雨,巴巴,大病,塑料,饼干,节奏,乐谱,吉祥,企盼,急速,日寇,英武,气概,伤感,苍茫,石碑,抑扬顿挫,相依,相随,焦躁不安,漫不经心,久别重逢,不幸,震耳,浴血,搏杀,储备,干脆,失踪,闲逛,镌刻,黯淡,知觉,落落,冷清,直勾勾,不甘落后,落后,千方百计,百计,哭笑不得,长途,大摇大摆,无影无踪,谱写,幽静,蜡烛,失明,纯属,陌生,清幽,陶醉,飞奔,记录,因河,时间,微波,探访,交涉,赴约,淡雅,捉摸,衬托,幻觉,深远,降生,模仿,身段,造就,抗议,风度,炼就,毅力,有朝一日,彼岸,暗无天日,金星一,一反常态,常态,为所欲为,不在话下,窃窃私语,无言以对',
        '6,1' => '挪移,游丝,插秧,枯萎,基业,幸而,一番,考验,锻炼,转化,优雅,赤裸裸,专心致志,重心,狂风暴雨,暴雨,勃勃生机,生机,哲理,英俊,幅度,慌乱,艰难,喧哗,附和,冒险,消受,机敏,堂皇,名义,薄弱,附庸,刹那,座无虚席,虚席,意想不到,惊心动魄,心动,养尊处优,展览,蒜瓣,饺子,翡翠,杂拌,栗子,风筝,预备,彩排,鞭炮,寺院,彩绘,庙会,麦芽,走马灯,七八,万象,更新,张灯结彩,剧种,面具,激流,发誓,旷野,布施,鼻祖,柔顺,压抑,敦厚,夸张,描述,演绎,布局,和睦,酷热,激昂,抽象,韵味,哄堂大笑,别无所求,蜂拥而至,铺天盖地,盖地,肃然起敬,美不胜收,书籍,含糊,尖锐,抽屉,恐怖,粗暴,魔鬼,肥胖,苦刑,残暴,拘留,窝头,兴旺,解救,哀思,蓬蓬,炊事员,精兵简政,死得其所,重于泰山,轻于鸿毛,战地,突击,陷入,阻击,点燃,性命,焦急,审阅,陈设,极其,转椅,隔壁,思索,腾腾,乖巧,围裙,硬币,裂缝,橱窗,饥饿,礼拜,生锈,昏暗,眯缝,耸肩,一缕,毒打,撇嘴,欺负,抽噎,匣子,冻僵,逗笑,孤儿,甜蜜,圣诞树,黑糊糊,笑眯眯,无赖,凶悍,救援,淡忘,起初,苦闷,消极,游手好闲,落荒而逃,鱼贯而入,满不在乎,不在乎,天涯海角,闻所未闻,与世隔绝,分析,顽强,侵蚀,隐退,乏力,荣誉,头衔,捐赠,诞生,洗澡,机械,玫瑰,领域,里程碑,卓有成效,成效,司空见惯,无独有偶,独有,见微知著,瑰丽,尝试,火箭,捆绑,穿越,振奋,规模,协作,精细,概括,评价,魄力,编造,强调,教训,驳倒,论证,权威,糊弄,嫦娥奔月,炎黄子孙,积劳成疾,风华正茂,华正茂,出人意料,意料,目瞪口呆,饶有趣味,趣味'
    );


    public function make()
    {
        foreach ($this->content as $key=>$item){
            $term = explode(',', $key);
            $grade = $term[0];
            $term = $term[1];
            $items = explode(',', $item);

            foreach ($items as $wordGroup){
                $found = MWordGroup::where('word_group', $wordGroup)->first();
                if(!$found){
                    $newWordGroup = new MWordGroup();
                    $newWordGroup->word_group = $wordGroup;
                    //list($grade, $term) = $this->computeGradeAndTerm($wordGroup);
                    $newWordGroup->grade = $grade;
                    $newWordGroup->term = $term;
                    $newWordGroup->excellent = 2;
                    $newWordGroup->save();
                    echo $wordGroup.' ok';
                }
                else{
                    echo $wordGroup.' 已存在';
                }
            }
        }
        return

            $total = "";
        $content = file_get_contents('d:/人教版小学语文词语盘点.txt');
        $content = explode("\r\n", $content);
        foreach ($content as $item) {
            $r = $this->checkWord($item);
            if (is_array($r))
                $total = $total . "\r\n" . implode(',', $r);
            else
                $total = $total . "\r\n" . $r;
        }
        file_put_contents("d:/test.txt", $total);
        dd($total);
        return;

        $content = explode(' ', $this->content);
        foreach ($content as $item) {
            $found = MWordGroup::where("word_group", $item)->first();
            if (!$found) {
                $wordGroup = new MWordGroup();
                $wordGroup->word_group = $item;
                $wordGroup->save();
            }
        }
        return;
        $newWords = MNewWord::orderBy('grade')
            ->where('word_id', '>=', 681)
            ->orderBy('term')//->limit(10)
            ->get();
        $newWords->each(function ($newWord, $key) {
            Log::info('word = ' . $newWord->word);
            $wordGroups = $this->searchWordGroup($newWord->word);
            if ($wordGroups) {
                $wordGroups = collect($wordGroups);
                $wordGroups->filter(function ($wordGroup, $key) use ($newWord) {
                    return strpos($wordGroup, $newWord->word);
                })->each(function ($wordGroup, $key) {
                    MWordGroup::where('word_group', $wordGroup)->delete();

                    $newWordGroup = new MWordGroup();
                    $newWordGroup->word_group = $wordGroup;
                    list($grade, $term) = $this->computeGradeAndTerm($wordGroup);
                    $newWordGroup->grade = $grade;
                    $newWordGroup->term = $term;
                    $newWordGroup->save();
                });
                sleep(5);
            }
        });
        return 'success';
    }

    private function computeGradeAndTerm($wordGroup)
    {
        $pattern = '/[\x{4e00}-\x{9fa5}]/u';
        $grade = -1;
        $term = -1;
        if (preg_match_all($pattern, $wordGroup, $matches)) {
            Log::info('$matches  =' . json_encode($matches));
            $newWords = collect($matches[0]);
            $newWords->each(function ($item, $key) use (&$grade, &$term, $wordGroup) {
                $newWord = MNewWord::where('word', $item)
                    ->first();
                if ($newWord) {
                    if (($grade * 10 + $term) < ($newWord->grade * 10 + $newWord->term)) {
                        $grade = $newWord->grade;
                        $term = $newWord->term;
                    }
                } else {
                    Log::info('生僻字 = ' . $wordGroup);
                    $grade = 9;
                    $term = 9;
                }
            });
        }
        return array($grade, $term);
    }

    //调用梁斌分词，过滤乱七八糟的词组
    private function checkWord($words)
    {
        if (is_array($words)) $words = implode(',', $words);

        Log::info('fenci = ' . $words);
        $client = new Client([
            'base_uri' => 'http://api.pullword.com/',
            'timeout' => 5.0,
        ]);
        $url = 'http://' . $this->splitServer[$this->splitIndex++] . '/get.php?source=' . urlencode($words) . ' &param1=0.8&param2=0';
        if ($this->splitIndex >= 3) $this->splitIndex = 0;
        try {
            $response = $client->request('GET', $url);
            $code = $response->getStatusCode();
            if ($code == 200) {
                $body = $response->getBody();
                $pattern = '/[\x{4e00}-\x{9fa5}].*/u';
                if (preg_match_all($pattern, $body, $matches)) {
                    $result = $matches[0];
                    foreach ($result as $key => $item) {
                        $result[$key] = str_replace("\r", "", $item);

                    }
                    return $result;
                }
                return null;
            }
        } catch (Exception $e) {
            Log::info('sleep 60 seconds');
            sleep(60);
            return $this->checkWord($words);
        }
    }

    //调用百度汉语，查找词组
    private function searchWordGroup($word)
    {
        Log::info('baidu = ' . $word);
        $client = new Client([
            'base_uri' => 'https://hanyu.baidu.com',
            'timeout' => 5.0,
        ]);
        $url = 'https://hanyu.baidu.com/s?wd=' . urlencode($word) . '&from=zici';
        try {
            $response = $client->request('GET', $url);
            $code = $response->getStatusCode();
            if ($code == 200) {
                $body = $response->getBody();
                $pinyinPattern = '/<a href=".*ptype=term">([\x{4e00}-\x{9fa5}].*)<\/a>/u';
                if (preg_match_all($pinyinPattern, $body, $matches)) {
                    return $this->checkWord($matches[1]);
                }
                return null;
            } else {
                throw new Exception('$word = ' . $word . ' error, $code = ' . $code);
            }
        } catch (Exception $e) {
            Log::info('sleep 60 seconds for baidu');
            sleep(60);
            return $this->searchWordGroup($word);
        }
    }

    /**
     * 词组拆分为单字，便于拼音标注
     */
    public function split()
    {
        $pattern = '/[\x{4e00}-\x{9fa5}]/u';
        $newWords = MNewWord::orderBy('grade')
            ->orderBy('term')
            ->get();
        $wordGroups = MWordGroup::orderBy('grade')
            ->orderBy('term')
            ->get();
        $wordGroups->each(function ($item, $key) use ($pattern, $newWords) {
            if (preg_match_all($pattern, $item->word_group, $matches)) {
                $split_json = array();
                foreach ($matches[0] as $word) {
                    $new_word = $newWords->where('word', $word)->first();
                    $split_json[$word] = array(
                        'grade' => $new_word->grade,
                        'term' => $new_word->term,
                        'pinyin' => $new_word->pinyin,
                    );
                }
                Log::info(json_encode($split_json));
                MWordGroup::where('word_group', $item->word_group)
                    ->update(
                        array('split_json' => json_encode($split_json))
                    );
            }
        });

    }

    public function replace($raw_word_group, $new_word_group)
    {
        MWordGroup::where('word_group', 'like', $raw_word_group . '%')
            ->update(
                array('word_group' => $new_word_group)
            );
    }

}
